aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx231/r_s12ad_rx231.c
/* In RAM */
extern adc_ctrl_t g_dcb;

/* In ROM. A/D Data Register pointers */
volatile __evenaccess uint16_t * const  dreg_ptrs[ADC_REG_MAX+1] =
                      { &S12AD.ADDR0,     // channel 0
                        &S12AD.ADDR1,     // channel 1
                        &S12AD.ADDR2,     // channel 2
                        &S12AD.ADDR3,     // channel 3
                        &S12AD.ADDR4,     // channel 4
                        &S12AD.ADDR5,     // channel 5
                        &S12AD.ADDR6,     // channel 6
                        &S12AD.ADDR7,     // channel 7
                        &S12AD.ADDR16,    // channel 16
                        &S12AD.ADDR17,    // channel 17
                        &S12AD.ADDR18,    // channel 18
                        &S12AD.ADDR19,    // channel 19
                        &S12AD.ADDR20,    // channel 20
                        &S12AD.ADDR21,    // channel 21
                        &S12AD.ADDR22,    // channel 22
                        &S12AD.ADDR23,    // channel 23
                        &S12AD.ADDR24,    // channel 24
                        &S12AD.ADDR25,    // channel 25
                        &S12AD.ADDR26,    // channel 26
                        &S12AD.ADDR27,    // channel 27
                        &S12AD.ADDR28,    // channel 28
                        &S12AD.ADDR29,    // channel 29
                        &S12AD.ADDR30,    // channel 30
                        &S12AD.ADDR31,    // channel 31
                        &S12AD.ADTSDR,    // temperature sensor
                        &S12AD.ADOCDR,    // voltage sensor
                        &S12AD.ADDBLDR,   // Data Duplication register
                        &S12AD.ADRD.WORD  // self-diagnosis register
                      };


/* In ROM. Sample State (SST) Register pointers */
// 8-bit register pointers
volatile __evenaccess uint8_t * const  sreg_ptrs[ADC_SST_REG_MAX+1] =
                      { &S12AD.ADSSTR0,     // channel 0
                        &S12AD.ADSSTR1,     // channel 1
                        &S12AD.ADSSTR2,     // channel 2
                        &S12AD.ADSSTR3,
                        &S12AD.ADSSTR4,
                        &S12AD.ADSSTR5,
                        &S12AD.ADSSTR6,
                        &S12AD.ADSSTR7,     // channel 7
                        &S12AD.ADSSTRL,     // channels 16 to 31
                        &S12AD.ADSSTRT,     // temperature sensor output
                        &S12AD.ADSSTRO      // internal voltage reference
                      };


/******************************************************************************
* Function Name: adc_open
* Description  : This function applies power to the A/D peripheral, sets the
*                operational mode, trigger sources, interrupt priority, and
*                configurations common to all channels and sensors. If interrupt
*                priority is non-zero, the function takes a callback function
*                pointer for notifying the user at interrupt level whenever a
*                scan has completed.
*
* Arguments    : unit -
*                    Ignored for rx231. Pass 0 for this argument.
*                mode -
*                    Operational mode (see enumeration below)
*                p_cfg-
*                    Pointer to configuration structure (see below)
*                p_callback-
*                    Optional pointer to function called from interrupt when
*                    a scan completes
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_AD_LOCKED-
*                    Open() call is in progress elsewhere
*                ADC_ERR_AD_NOT_CLOSED-
*                    Peripheral is still running in another mode; Perform
*                    R_ADC_Close() first
*                ADC_ERR_INVALID_ARG-
*                    mode or element of p_cfg structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon mode
*                ADC_ERR_MISSING_PTR-
*                    p_cfg pointer is FIT_NO_PTR/NULL
*******************************************************************************/
adc_err_t adc_open(uint8_t     const   unit,
                   adc_mode_t  const   mode,
                   adc_cfg_t * const   p_cfg,
                   void     (* const   p_callback)(void *p_args))
{
    aregs_t             *p_regs;
    volatile uint16_t   u16_dummy;  /* Dummy read for "1" change to "0".(read first) */
    volatile uint8_t    u8_dummy;   /* Dummy read for "1" change to "0".(read first) */

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    if ((p_cfg == NULL) || (p_cfg == FIT_NO_PTR))
    {
        return ADC_ERR_MISSING_PTR;
    }

    err = adc_check_open_cfg(mode, p_cfg, p_callback);
    if (err != ADC_SUCCESS)
    {
        return err;
    }
#endif

    /* ENSURE OPEN() NOT ALREADY IN PROGRESS */
    if (g_dcb.opened == true)
    {
        return ADC_ERR_AD_NOT_CLOSED;
    }
    if (R_BSP_HardwareLock(BSP_LOCK_S12AD) == false)
    {
        return ADC_ERR_AD_LOCKED;
    }

    /* APPLY POWER TO PERIPHERAL */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    MSTP(S12AD) = 0;
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    p_regs = (aregs_t *)&S12AD;
    p_regs->ADCSR.WORD = p_regs->ADCSR.WORD & 0x0400;
    p_regs->ADEXICR.WORD = 0;  //Don't convert Temp Sensor and Internal Reference

    p_regs->ADANSA0.WORD = 0;
    p_regs->ADANSA1.WORD = 0;
    p_regs->ADANSB0.WORD = 0;
    p_regs->ADANSB1.WORD = 0;

    p_regs->ADADS0.WORD = 0;
    p_regs->ADADS1.WORD = 0;
    
    p_regs->ADADC.BYTE = 0;
    
    p_regs->ADCER.WORD = 0;
    p_regs->ADSTRGR.WORD = 0;

    p_regs->ADSSTR0 = 0x0d;
    p_regs->ADSSTR1 = 0x0d;
    p_regs->ADSSTR2 = 0x0d;
    p_regs->ADSSTR3 = 0x0d;
    p_regs->ADSSTR4 = 0x0d;
    p_regs->ADSSTR5 = 0x0d;
    p_regs->ADSSTR6 = 0x0d;
    p_regs->ADSSTR7 = 0x0d;
    p_regs->ADSSTRL = 0x0d;
    p_regs->ADSSTRT = 0x0d;
    p_regs->ADSSTRO = 0x0d;
    
    p_regs->ADDISCR.BYTE = 0;
    p_regs->ADELCCR.BYTE = 0;
    p_regs->ADGSPCR.WORD = 0;

    p_regs->ADCMPCR.WORD = 0;
    p_regs->ADCMPANSR0.WORD = 0;
    p_regs->ADCMPANSR1.WORD = 0;
    p_regs->ADCMPANSER.BYTE = 0;
    p_regs->ADCMPLR0.WORD = 0;
    p_regs->ADCMPLR1.WORD = 0;

    p_regs->ADCMPLER.BYTE = 0;
    
    p_regs->ADCMPDR0 = 0;
    p_regs->ADCMPDR1 = 0;
    u16_dummy = p_regs->ADCMPSR0.WORD;
    p_regs->ADCMPSR0.WORD = 0;          /* target bit clear by read-modify-write */
    u16_dummy = p_regs->ADCMPSR1.WORD;
    p_regs->ADCMPSR1.WORD = 0;          /* target bit clear by read-modify-write */
    
    u8_dummy = p_regs->ADCMPSER.BYTE;
    p_regs->ADCMPSER.BYTE = 0;          /* target bit clear by read-modify-write */
    p_regs->ADHVREFCNT.BYTE = 0;
    
    p_regs->ADCMPBNSR.BYTE = 0;
    p_regs->ADWINLLB = 0;
    p_regs->ADWINULB = 0;
    u8_dummy = p_regs->ADCMPBSR.BYTE;
    p_regs->ADCMPBSR.BYTE = 0;          /* target bit clear by read-modify-write */
    
    p_regs->ADBUFEN.BYTE = 0;
    p_regs->ADBUFPTR.BYTE = 0;
    
