aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx231/r_s12ad_rx231.c
    return ADC_SUCCESS;
}
#endif


/******************************************************************************
* Function Name: adc_enable_s12gbadi
* Description  : This function clears the S12GBADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : none
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gbadi(void)
{
    IR(S12AD,GBADI) = 0;            // clear flag
    S12AD.ADCSR.BIT.GBADIE = 1;     // enable in peripheral
    if (IPR(S12AD,GBADI) != 0)
    {
        IEN(S12AD,GBADI) = 1;       // enable in ICU
    }
}


/******************************************************************************
* Function Name: adc_close
* Description  : This is the RX231 implementation of R_ADC_Close().
*                This function ends any scan in progress, disables interrupts,
*                and removes power to the A/D peripheral.
* Arguments    : unit - This argument is ignored for the RX231.
* Return Value : ADC_SUCCESS
*******************************************************************************/
adc_err_t adc_close(uint8_t const  unit)
{
    volatile uint8_t i;
    aregs_t     *p_regs = (aregs_t *)&S12AD;

    /* Stop triggers & conversions, and disable peripheral interrupts */
    IEN(S12AD,S12ADI0) = 0;     // disable interrupts in ICU
    IR(S12AD,S12ADI0) = 0;      // clear interrupt flag
    IEN(S12AD,GBADI) = 0;       // disable interrupts in ICU
    IR(S12AD,GBADI) = 0;        // clear interrupt flag

    p_regs->ADGSPCR.BIT.PGS = 0;
    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.WORD = 0x3F3F;
    }
    else
    {
        p_regs->ADSTRGR.BIT.TRSA = 0x3F;
    }

    p_regs->ADCSR.WORD = p_regs->ADCSR.WORD & 0x0400;
    if (0x0000 == (p_regs->ADCSR.WORD & 0xFBFF))   // dummy read for waiting until set the value of ADCSR
    {
        nop();
    }

    /* Wait for 2 ADCLK cycles (MAX: 128 ICLK cycles) */
    for (i = 0; i < 128; i++)
    {
        nop();
    }

    /* Power down peripheral */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    MSTP(S12AD) = 1;
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Show driver as closed */

    g_dcb.opened = false;

    return ADC_SUCCESS;
}


/******************************************************************************
* Function Name: adc_read_all
* Description  : This is the RX231 implementation of R_ADC_ReadAll().
*                It reads conversion results from all potential sources,
*                enabled or not.
* Arguments    : p_all_data-
*                    Pointer to structure to load register values into.
* Return Value : ADC_SUCCESS-
*                    Successful
*******************************************************************************/
adc_err_t adc_read_all(adc_data_t * const  p_all_data)
{
    p_all_data->chan[ADC_REG_CH0]  = S12AD.ADDR0;
    p_all_data->chan[ADC_REG_CH1]  = S12AD.ADDR1;
    p_all_data->chan[ADC_REG_CH2]  = S12AD.ADDR2;
    p_all_data->chan[ADC_REG_CH3]  = S12AD.ADDR3;
    p_all_data->chan[ADC_REG_CH4]  = S12AD.ADDR4;
    p_all_data->chan[ADC_REG_CH5]  = S12AD.ADDR5;
    p_all_data->chan[ADC_REG_CH6]  = S12AD.ADDR6;
    p_all_data->chan[ADC_REG_CH7]  = S12AD.ADDR7;

    p_all_data->chan[ADC_REG_CH16] = S12AD.ADDR16;
    p_all_data->chan[ADC_REG_CH17] = S12AD.ADDR17;
    p_all_data->chan[ADC_REG_CH18] = S12AD.ADDR18;
    p_all_data->chan[ADC_REG_CH19] = S12AD.ADDR19;
    p_all_data->chan[ADC_REG_CH20] = S12AD.ADDR20;
    p_all_data->chan[ADC_REG_CH21] = S12AD.ADDR21;
    p_all_data->chan[ADC_REG_CH22] = S12AD.ADDR22;
    p_all_data->chan[ADC_REG_CH23] = S12AD.ADDR23;
    p_all_data->chan[ADC_REG_CH24] = S12AD.ADDR24;
    p_all_data->chan[ADC_REG_CH25] = S12AD.ADDR25;
    p_all_data->chan[ADC_REG_CH26] = S12AD.ADDR26;
    p_all_data->chan[ADC_REG_CH27] = S12AD.ADDR27;
    p_all_data->chan[ADC_REG_CH28] = S12AD.ADDR28;
    p_all_data->chan[ADC_REG_CH29] = S12AD.ADDR29;
    p_all_data->chan[ADC_REG_CH30] = S12AD.ADDR30;
    p_all_data->chan[ADC_REG_CH31] = S12AD.ADDR31;

    p_all_data->temp               = S12AD.ADTSDR;
    p_all_data->volt               = S12AD.ADOCDR;

    p_all_data->dbltrig            = S12AD.ADDBLDR;
    p_all_data->self_diag          = S12AD.ADRD.WORD;

    return ADC_SUCCESS;
}


#endif // #if defined (BSP_MCU_RX231)
